rest-server/src/gSoapFiles/IPAWS/CAPSoapHttp.getMessage.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns3="http://gov.fema.ipaws.services/caprequest"
    xmlns:ns4="http://gov.fema.ipaws.services/capresponse"
    xmlns:ns5="urn:oasis:names:tc:emergency:cap:1.2"
    xmlns:ns2="http://gov.fema.ipaws.services/IPAWS_CAPService/">
 <SOAP-ENV:Header>
  <ns2:CAPHeaderTypeDef SOAP-ENV:mustUnderstand="1">
   <ns2:logonUser xsi:type="xsd:string"></ns2:logonUser>
   <ns2:logonCogId xsi:type="xsd:int">0</ns2:logonCogId>
  </ns2:CAPHeaderTypeDef>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns2:getMessageTypeDef xsi:type="ns3:requestParameterList">
    <ns3:requestAPI xsi:type="xsd:string"></ns3:requestAPI>
    <ns3:requestOperation xsi:type="xsd:string"></ns3:requestOperation>
    <ns3:parameters xsi:type="ns3:parameterListItem">
     <ns3:parameterName xsi:type="xsd:string"></ns3:parameterName>
     <ns3:comparisonOp xsi:type="xsd:string"></ns3:comparisonOp>
     <ns3:parameterValue xsi:type="xsd:string"></ns3:parameterValue>
     <ns3:logicalOp xsi:type="xsd:string"></ns3:logicalOp>
    </ns3:parameters>
   </ns2:getMessageTypeDef>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
